RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/ef_data_1_reg.h
/* 0xDC : ef_key_slot_9_w3 */
#define EF_DATA_1_EF_KEY_SLOT_9_W3_OFFSET (0xDC)
#define EF_DATA_1_EF_KEY_SLOT_9_W3        EF_DATA_1_EF_KEY_SLOT_9_W3
#define EF_DATA_1_EF_KEY_SLOT_9_W3_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_9_W3_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_9_W3_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_9_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_9_W3_POS)
#define EF_DATA_1_EF_KEY_SLOT_9_W3_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_9_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_9_W3_POS))

/* 0xE0 : ef_key_slot_10_w0 */
#define EF_DATA_1_EF_KEY_SLOT_10_W0_OFFSET (0xE0)
#define EF_DATA_1_EF_KEY_SLOT_10_W0        EF_DATA_1_EF_KEY_SLOT_10_W0
#define EF_DATA_1_EF_KEY_SLOT_10_W0_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_10_W0_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_10_W0_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_10_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W0_POS)
#define EF_DATA_1_EF_KEY_SLOT_10_W0_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_10_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W0_POS))

/* 0xE4 : ef_key_slot_10_w1 */
#define EF_DATA_1_EF_KEY_SLOT_10_W1_OFFSET (0xE4)
#define EF_DATA_1_EF_KEY_SLOT_10_W1        EF_DATA_1_EF_KEY_SLOT_10_W1
#define EF_DATA_1_EF_KEY_SLOT_10_W1_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_10_W1_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_10_W1_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_10_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W1_POS)
#define EF_DATA_1_EF_KEY_SLOT_10_W1_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_10_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W1_POS))

/* 0xE8 : ef_key_slot_10_w2 */
#define EF_DATA_1_EF_KEY_SLOT_10_W2_OFFSET (0xE8)
#define EF_DATA_1_EF_KEY_SLOT_10_W2        EF_DATA_1_EF_KEY_SLOT_10_W2
#define EF_DATA_1_EF_KEY_SLOT_10_W2_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_10_W2_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_10_W2_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_10_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W2_POS)
#define EF_DATA_1_EF_KEY_SLOT_10_W2_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_10_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W2_POS))

/* 0xEC : ef_key_slot_10_w3 */
#define EF_DATA_1_EF_KEY_SLOT_10_W3_OFFSET (0xEC)
#define EF_DATA_1_EF_KEY_SLOT_10_W3        EF_DATA_1_EF_KEY_SLOT_10_W3
#define EF_DATA_1_EF_KEY_SLOT_10_W3_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_10_W3_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_10_W3_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_10_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W3_POS)
#define EF_DATA_1_EF_KEY_SLOT_10_W3_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_10_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_10_W3_POS))

/* 0xF0 : ef_dat_1_rsvd_0 */
#define EF_DATA_1_EF_DAT_1_RSVD_0_OFFSET (0xF0)
#define EF_DATA_1_EF_DAT_1_RSVD_0        EF_DATA_1_EF_DAT_1_RSVD_0
#define EF_DATA_1_EF_DAT_1_RSVD_0_POS    (0U)
#define EF_DATA_1_EF_DAT_1_RSVD_0_LEN    (32U)
#define EF_DATA_1_EF_DAT_1_RSVD_0_MSK    (((1U << EF_DATA_1_EF_DAT_1_RSVD_0_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_0_POS)
#define EF_DATA_1_EF_DAT_1_RSVD_0_UMSK   (~(((1U << EF_DATA_1_EF_DAT_1_RSVD_0_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_0_POS))

/* 0xF4 : ef_dat_1_rsvd_1 */
#define EF_DATA_1_EF_DAT_1_RSVD_1_OFFSET (0xF4)
#define EF_DATA_1_EF_DAT_1_RSVD_1        EF_DATA_1_EF_DAT_1_RSVD_1
#define EF_DATA_1_EF_DAT_1_RSVD_1_POS    (0U)
#define EF_DATA_1_EF_DAT_1_RSVD_1_LEN    (32U)
#define EF_DATA_1_EF_DAT_1_RSVD_1_MSK    (((1U << EF_DATA_1_EF_DAT_1_RSVD_1_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_1_POS)
#define EF_DATA_1_EF_DAT_1_RSVD_1_UMSK   (~(((1U << EF_DATA_1_EF_DAT_1_RSVD_1_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_1_POS))

/* 0xF8 : ef_dat_1_rsvd_2 */
#define EF_DATA_1_EF_DAT_1_RSVD_2_OFFSET (0xF8)
#define EF_DATA_1_EF_DAT_1_RSVD_2        EF_DATA_1_EF_DAT_1_RSVD_2
#define EF_DATA_1_EF_DAT_1_RSVD_2_POS    (0U)
#define EF_DATA_1_EF_DAT_1_RSVD_2_LEN    (32U)
#define EF_DATA_1_EF_DAT_1_RSVD_2_MSK    (((1U << EF_DATA_1_EF_DAT_1_RSVD_2_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_2_POS)
#define EF_DATA_1_EF_DAT_1_RSVD_2_UMSK   (~(((1U << EF_DATA_1_EF_DAT_1_RSVD_2_LEN) - 1) << EF_DATA_1_EF_DAT_1_RSVD_2_POS))

/* 0xFC : ef_data_1_lock */
#define EF_DATA_1_LOCK_OFFSET               (0xFC)
#define EF_DATA_1_WR_LOCK_RSVD_1            EF_DATA_1_WR_LOCK_RSVD_1
#define EF_DATA_1_WR_LOCK_RSVD_1_POS        (0U)
#define EF_DATA_1_WR_LOCK_RSVD_1_LEN        (15U)
#define EF_DATA_1_WR_LOCK_RSVD_1_MSK        (((1U << EF_DATA_1_WR_LOCK_RSVD_1_LEN) - 1) << EF_DATA_1_WR_LOCK_RSVD_1_POS)
#define EF_DATA_1_WR_LOCK_RSVD_1_UMSK       (~(((1U << EF_DATA_1_WR_LOCK_RSVD_1_LEN) - 1) << EF_DATA_1_WR_LOCK_RSVD_1_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_4        EF_DATA_1_WR_LOCK_KEY_SLOT_4
#define EF_DATA_1_WR_LOCK_KEY_SLOT_4_POS    (15U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_4_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_4_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_4_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_4_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_4_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_5        EF_DATA_1_WR_LOCK_KEY_SLOT_5
#define EF_DATA_1_WR_LOCK_KEY_SLOT_5_POS    (16U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_5_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_5_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_5_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_5_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_5_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_6        EF_DATA_1_WR_LOCK_KEY_SLOT_6
#define EF_DATA_1_WR_LOCK_KEY_SLOT_6_POS    (17U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_6_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_6_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_6_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_6_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_6_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_6_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_6_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_7        EF_DATA_1_WR_LOCK_KEY_SLOT_7
#define EF_DATA_1_WR_LOCK_KEY_SLOT_7_POS    (18U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_7_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_7_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_7_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_7_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_7_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_7_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_7_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_8        EF_DATA_1_WR_LOCK_KEY_SLOT_8
#define EF_DATA_1_WR_LOCK_KEY_SLOT_8_POS    (19U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_8_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_8_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_8_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_8_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_8_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_8_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_8_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_9        EF_DATA_1_WR_LOCK_KEY_SLOT_9
#define EF_DATA_1_WR_LOCK_KEY_SLOT_9_POS    (20U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_9_LEN    (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_9_MSK    (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_9_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_9_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_9_UMSK   (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_9_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_9_POS))
#define EF_DATA_1_WR_LOCK_KEY_SLOT_10       EF_DATA_1_WR_LOCK_KEY_SLOT_10
#define EF_DATA_1_WR_LOCK_KEY_SLOT_10_POS   (21U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_10_LEN   (1U)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_10_MSK   (((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_10_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_10_POS)
#define EF_DATA_1_WR_LOCK_KEY_SLOT_10_UMSK  (~(((1U << EF_DATA_1_WR_LOCK_KEY_SLOT_10_LEN) - 1) << EF_DATA_1_WR_LOCK_KEY_SLOT_10_POS))
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_0      EF_DATA_1_WR_LOCK_DAT_1_RSVD_0
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_POS  (22U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_LEN  (1U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_MSK  (((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_POS)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_UMSK (~(((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_0_POS))
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_1      EF_DATA_1_WR_LOCK_DAT_1_RSVD_1
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_POS  (23U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_LEN  (1U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_MSK  (((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_POS)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_UMSK (~(((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_1_POS))
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_2      EF_DATA_1_WR_LOCK_DAT_1_RSVD_2
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_POS  (24U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_LEN  (1U)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_MSK  (((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_POS)
#define EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_UMSK (~(((1U << EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_LEN) - 1) << EF_DATA_1_WR_LOCK_DAT_1_RSVD_2_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_4        EF_DATA_1_RD_LOCK_KEY_SLOT_4
#define EF_DATA_1_RD_LOCK_KEY_SLOT_4_POS    (25U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_4_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_4_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_4_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_4_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_4_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_5        EF_DATA_1_RD_LOCK_KEY_SLOT_5
#define EF_DATA_1_RD_LOCK_KEY_SLOT_5_POS    (26U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_5_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_5_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_5_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_5_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_5_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_6        EF_DATA_1_RD_LOCK_KEY_SLOT_6
#define EF_DATA_1_RD_LOCK_KEY_SLOT_6_POS    (27U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_6_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_6_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_6_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_6_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_6_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_6_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_6_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_7        EF_DATA_1_RD_LOCK_KEY_SLOT_7
#define EF_DATA_1_RD_LOCK_KEY_SLOT_7_POS    (28U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_7_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_7_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_7_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_7_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_7_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_7_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_7_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_8        EF_DATA_1_RD_LOCK_KEY_SLOT_8
#define EF_DATA_1_RD_LOCK_KEY_SLOT_8_POS    (29U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_8_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_8_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_8_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_8_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_8_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_8_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_8_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_9        EF_DATA_1_RD_LOCK_KEY_SLOT_9
#define EF_DATA_1_RD_LOCK_KEY_SLOT_9_POS    (30U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_9_LEN    (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_9_MSK    (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_9_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_9_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_9_UMSK   (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_9_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_9_POS))
#define EF_DATA_1_RD_LOCK_KEY_SLOT_10       EF_DATA_1_RD_LOCK_KEY_SLOT_10
#define EF_DATA_1_RD_LOCK_KEY_SLOT_10_POS   (31U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_10_LEN   (1U)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_10_MSK   (((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_10_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_10_POS)
#define EF_DATA_1_RD_LOCK_KEY_SLOT_10_UMSK  (~(((1U << EF_DATA_1_RD_LOCK_KEY_SLOT_10_LEN) - 1) << EF_DATA_1_RD_LOCK_KEY_SLOT_10_POS))

struct ef_data_1_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[128];

